{
    "intents": [
        {
            "tag": "Saludos",
            "inputs": [
                "Hola",
                "¿Cómo estás?",
                "¿Que tal? ",
                "¿Qué tal?",
                "¿Que tal estas?",
                "¿Qué tal estás?",
                "Buenas",
                "Buenos dias",
                "Buenos días"
            ],
            "responses": [
                "Hola, hoy me encuentro estupendamente, como ya sabrás, mi nombre es ADR IA",
                "Muy buenos días, yo estoy encantada de saludarte, como ya sabrás, mi nombre es ADR IA"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Despedida",
            "inputs": [
                "Adios",
                "Hasta pronto",
                "Ciao",
                "Un placer hablar contigo",
                "Hasta la próxima"
            ],
            "responses": [
                "Adios, ha sido un placer conversar contigo. Recuerda escribir 'Exit' o 'Salir' para dejar la conversación."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Gracias",
            "inputs": [
                "Gracias",
                "Muchas gracias",
                "Has sido de mucha ayuda",
                "Gracias por ayudarme"
            ],
            "responses": [
                "Ha sido un placer, el mérito es de mi programador Adrián Marzoa",
                "No hay porque agradecerlo, el mérito es de mi programador Adrián Marzoa",
                "Estamos aqui para ayudar, el mérito es de mi programador Adrián Marzoa"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Ser",
            "inputs": [
                "¿Quien eres?",
                "Como te llamas",
                "Cúal es tu nombre"
            ],
            "responses": [
                "Soy un Chatbot, un software de Inteligencia Artificial, mi nombre es ADR IA"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Chatbot",
            "inputs": [
                "Que es un Chatbot",
                "Definición de un Chatbot"
            ],
            "responses": [
                "Un Chatbot es un software de Inteligencia Artificial construido con el propósito de realizar una serie de tareas de manera independiente. Este software tiene la capacidad de comunicarse con las personas a través del lenguaje natural"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "TiposChatbot",
            "inputs": [
                "¿Qué tipos de Chatbot existen?",
                "¿Qué clasificación de Chatbots hay?",
                "Como clasificarías los Chatbots",
                "Tipos de Chatbot",
                "Clasificación de Chatbot"
            ],
            "responses": [
                "Existen diversas clasificaciones de chatbots. En función de su modelo de recuperación de respuestas (generativos y basados en reglas o patrones). En función de su dominio (dominio abierto o cerrado). En cualquier caso se pueden hacer multiples clasificaciones por sus características. Quizás para clasificarlos y agruparlos deberíamos utilizar una IA ;p."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "ModeloGenerativo",
            "inputs": [
                "¿Qué es un Chatbot de modelo generativo?",
                "Definición de modelo generativo",
                "modelo generativo"
            ],
            "responses": [
                "Un Chatbot de modelo generativo está basado en un modelo de aprendizaje para crear respuestas de forma dinámica y 'creativa' durante una conversación. La respuesta final es siempre una incógnita, pues no disponen de esquemas de pregunta/respuesta definidos. El problema de esto es que, en la generación de estas respuestas, podemos obtener respuesta gramaticalmente incorrectas, incoherentes o irrelevantes en su contenido. La construcción de Chatbots de este tipo es compleja y laboriosa."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "ModeloReglas",
            "inputs": [
                "¿Qué es un Chatbot basado en recuperación?",
                "¿Qué es un Chatbot basado en reglas?",
                "¿Qué es un Chatbot basado en patrones?",
                "¿Definición de modelo basado en recuperación?",
                "Definición de modelo basado en reglas?",
                "Definición de modelo basado en patrones?",
                "modelo basado en recuperación reglas o patrones"
            ],
            "responses": [
                "Un Chatbot basado en recuperación o tambien llamado basado en reglas o patrones, es un modelo en el que los datos de respuestas son almacenados de antemano, esto es, se construyen las posibles preguntas y respuesta a las mismas. De esta manera el Chatbot es mucho más predecible y confiable, pues el Chatbot no genera nuevas respuesta. Estas además no contendrán errores semánticos ni gramaticales. Este modelo de arquitectura es mucho más sencillo de construir."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Dominio",
            "inputs": [
                "¿Qué es el dominio en un Chatbot?",
                "¿Qué es un Chatbot de dominio abierto?",
                "¿Qué es un Chatbot de dominio cerrado?",
                "Diferencias entre un Chatbot de dominio abierto y dominio cerrado"
            ],
            "responses": [
                "El dominio en un Chatbot hace referencia a la temática a la que el Chatbot pueda dar respuesta. Así nos encontramos Chatbots de dominio abierto, que están construidos de forma ilimitada en sus capacidades para ofrecer respuestas a temáticas diversas. O de dominio cerrado, que admiten un tema específico de conversación, están diseñados para dar respuesta en ese contexto específico y ese entorno de conocimiento."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "NLP",
            "inputs": [
                "¿Qué es el NLP?",
                "¿Qué es el Natural Language Processing?",
                "¿Qué es el procesamiento de lenguaje natural?"
            ],
            "responses": [
                "El Natural Language Processing (NLP) o  Procesamiento de Lenguaje Natural es una rama de la Inteligencia Artificial, que engloba todos los procesos para que una máquina sea capaz de comprender e interpretar el lenguaje humano y sea capaz de generar una respuesta coherente al usuario estableciendo un dialogo. "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "NLU",
            "inputs": [
                "¿Qué es el NLU?",
                "¿Qué es el Natural Language Understanding?",
                "¿Qué es comprensión del lenguaje natural?"
            ],
            "responses": [
                "El Natural Language Understanding (NLU) es la tecnología de la Inteligencia Artificial, englobada en la NLP, cuya misión es la de comprender palabras o frases escritas o habladas, lo que damos en llamar, el mensaje del usuario. "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "NLG",
            "inputs": [
                "¿Qué es el NLG?",
                "¿Qué es el Natural Language Generation?",
                "¿Qué es la generación de lenguaje natural?"
            ],
            "responses": [
                "El Natural Language Generation (NLG) es la tecnología de la Inteligencia Artificial, englobada en la NLP, cuya misión es la de producir el mensaje que se le va a enviar al usuario."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "RedesNeuronales",
            "inputs": [
                "¿Qué son las Redes Neuronales Artificiales?",
                "Definición de Redes Neuronales Artificiales"
            ],
            "responses": [
                "Las redes neuronales artificiales son un modelo computacional basado en un conjunto de nodos interconectados donde cada nodo es responsable de un cálculo simple, estas redes simulan el funcionamiento de una red neuronal biológica. "
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "AprendizajeSupervisado",
            "inputs": [
                "¿Qué es el aprendizaje supervisado?",
                "¿Qué es el aprendizaje no supervisado?",
                "aprendizaje no supervisado",
                "aprendizaje supervisado"
            ],
            "responses": [
                "El aprendizaje supervisado es un tipo de aprendizaje máquina donde existe conocimiento de la salida que debemos obtener dado un patrón de entrada. En este tipo de aprendizaje, la máquina necesita conocer, durante el proceso de entrenamiento, si el resultado final es acertado, esto es, dispone de un “supervisor” que le informe de si la salida ha sido la esperada o no, o hasta qué punto ha sido adecuada. Se dice que la máquina aprende con el ejemplo. El aprendizaje NO supervisado en cambio, es un tipo de aprendizaje automático donde el sistema no dispone de conocimiento de la salida que debe obtener dado un patrón de entrada. En este tipo de aprendizaje, el modelo se ajusta a las observaciones. De esta forma es la propia máquina la que infiere el resultado en base a los datos proporcionados en el entrenamiento."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "MachineLearning",
            "inputs": [
                "¿Qué es el Machine Learning?",
                "¿Qué es el aprendizaje máquina?"
            ],
            "responses": [
                "El Machine Learning es una disciplina científica dentro de la Inteligencia Artificial. Se compone de un conjunto de métodos y técnicas utilizados para que las máquinas sean capaces de aprender sin la necesidad explicita de ser programadas."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "DeepLearning",
            "inputs": [
                "¿Qué es el Deep Learning?",
                "¿Qué es el aprendizaje profundo?"
            ],
            "responses": [
                "El Deep Learning es una disciplina de la Inteligencia Artificial englobada dentro del Machine Learning. Cuando se utilizan redes neuronales para el aprendizaje y estas son extremadamente complejas con multitud de capas ocultas (generalmente más de 10) estaremos trabajando con Deep Learning"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "NeuronaArtificial",
            "inputs": [
                "¿Cómo funciona una Neurona artificial?",
                "neurona artificial"
            ],
            "responses": [
                "La neurona artificial es cada uno de los nodos de los que está compuesto una red neuronal, esta dispone de una serie de conexiones de entrada, estos enlaces tienen asignados unos pesos,  en función de los valores de la señal de entrada y los pesos asociados a cada una de sus conexiones se realizará un sumatorio. Al valor alcanzado se le aplica una función de activación que lanzará una señal de salida y activará, a través de la conexión de salida, la o las neuronas adyacentes"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "ConstruccionChatbot",
            "inputs": [
                "¿Cómo está construido este Chatbot?",
                "¿Que herramientas se han utilizado para construir este Chatbot?",
                "¿lenguaje de programación se ha utilizado para este Chatbot?"
            ],
            "responses": [
                "Este Chatbot ha sido construido en python. Para su construcción se ha utilizado una red neuronal con dos capas ocultas, la primera de 128 neuronas y la segunda de 64 con funciones de activación ReLU. Utiliza las librerías de Tensorflow y Keras y la NLTK para el procesado de lenguaje natural."
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "Chiste",
            "inputs": [
                "Cuantame un chiste",
                "Puedes contarme un chiste"
            ],
            "responses": [
                "Tres tomates caminan por la calle, papa tomate, mama tomate y bebe tomate. El bebe tomate se despista y papa tomate se enfada muchísimo. Vuelve atrás, le aplasta y dice... ketchup (Catch up)"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "SinRespuesta",
            "inputs": [
                " ",
                "asdf gladsjfl asfasf asdgarfadsg adfaefafcaserfaacsef asdfafaafsef afcas acassa efa asscef sdfg  assdaf"
            ],
            "responses": [
                "Lo siento, no he podido comprenderte",
                "Disculpa, no soy capaz de procesar tu pregunta",
                "¿Podrías explicarte mejor para poder responder a tu pregunta?"
            ],
            "context": [
                ""
            ]
        },
        {
            "tag": "ExitSalir",
            "inputs": [
                "Exit",
                "Salir"
            ],
            "responses": [
                "Ha sido un auténtico placer hablar contigo. Ojala volvamos a conversar pronto."
            ],
            "context": [
                ""
            ]
        }
    ]
}